Repository: jwsscott777/WeldHandbook
Catalog: WeldHandbook/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fil_ph, ht, pt_br, zh_hans

source: This app is designed for quick reference of topics that are way more detailed in other books and volumes. This is no way an attempt to replace the wealth of knowledge that already exists. Use this app as a refresher or maybe something you don't remember but don't have time to research. Also, there is a section where if you are in school and are practicing your joints and positions you can keep track and save your progress in an organized way. Disclaimer: The information in this app is purely my own and in no way is it endorsed or affiliated with any authoratative organization. Use the information contained in this app at your own discretion and by all means, seek out the library of welding information from the American Welding Society and the ASME collection. Welding is a constantly evolving field and all illustrations and specific descriptions can be considered suitable for general guidance. It is the user of this apps choice to use it for his or hers intended application.
es_419: Esta aplicación está diseñada para una referencia rápida de temas que están mucho más detallados en otros libros y volúmenes. De ninguna manera se trata de un intento de reemplazar la riqueza de conocimientos que ya existe. Utilice esta aplicación como repaso o tal vez como algo que no recuerde pero no tenga tiempo para investigar. Además, hay una sección donde si estás en la escuela y estás practicando tus articulaciones y posiciones puedes realizar un seguimiento y guardar tu progreso de forma organizada. Descargo de responsabilidad: la información contenida en esta aplicación es puramente mía y de ninguna manera está respaldada ni afiliada a ninguna organización autorizada. Utilice la información contenida en esta aplicación a su propia discreción y, por supuesto, busque la biblioteca de información sobre soldadura de la American Welding Society y la colección ASME. La soldadura es un campo en constante evolución y todas las ilustraciones y descripciones específicas pueden considerarse adecuadas como orientación general. Es decisión del usuario de esta aplicación utilizarla para la aplicación prevista.
fil_ph: Idinisenyo ang app na ito para sa mabilis na sanggunian ng mga paksa na mas detalyado sa iba pang mga libro at volume. Ito ay hindi isang paraan ng pagtatangka upang palitan ang kayamanan ng kaalaman na umiiral na. Gamitin ang app na ito bilang isang refresher o maaaring isang bagay na hindi mo naaalala ngunit wala kang oras upang magsaliksik. Gayundin, mayroong isang seksyon kung saan kung ikaw ay nasa paaralan at nagsasanay ng iyong mga kasukasuan at mga posisyon maaari mong subaybayan at i-save ang iyong pag-unlad sa isang organisadong paraan. Disclaimer: Ang impormasyon sa app na ito ay puro sarili ko at hindi ito ineendorso o kaakibat sa anumang awtoratatibong organisasyon. Gamitin ang impormasyong nakapaloob sa app na ito sa iyong sariling paghuhusga at sa lahat ng paraan, hanapin ang library ng impormasyon sa welding mula sa American Welding Society at sa koleksyon ng ASME. Ang welding ay isang patuloy na umuusbong na larangan at lahat ng mga guhit at partikular na paglalarawan ay maaaring ituring na angkop para sa pangkalahatang patnubay. Ang gumagamit ng mga app na ito ay pinili upang gamitin ito para sa kanyang nilalayon na aplikasyon.
ht: Aplikasyon sa a fèt pou referans rapid nan sijè ki pi detaye nan lòt liv ak komèsan. Sa a se pa yon fason yon tantativ ranplase richès nan konesans ki deja egziste. Sèvi ak aplikasyon sa a kòm yon rafrechisman oswa petèt yon bagay ou pa sonje men ou pa gen tan fè rechèch. Epitou, gen yon seksyon kote si w nan lekòl epi w ap pratike jwenti w ak pozisyon w ka kenbe tras epi sove pwogrè w nan yon fason òganize. Limit responsabilite nou: Enfòmasyon ki nan aplikasyon sa a se piman pwòp mwen epi li nan okenn fason li andose oswa afilye ak nenpòt òganizasyon otoratif. Sèvi ak enfòmasyon ki nan aplikasyon sa a nan pwòp diskresyon ou ak pa tout vle di, chèche bibliyotèk la nan enfòmasyon soude nan Sosyete Ameriken an soude ak koleksyon an ASME. Soude se yon domèn ki toujou ap evolye epi yo ka konsidere tout ilistrasyon ak deskripsyon espesifik yo apwopriye pou konsèy jeneral. Li se itilizatè a nan chwa apps sa a yo sèvi ak li pou aplikasyon li gen entansyon.
pt_br: Este aplicativo foi projetado para referência rápida de tópicos muito mais detalhados em outros livros e volumes. Isto não é de forma alguma uma tentativa de substituir a riqueza de conhecimento que já existe. Use este aplicativo como uma atualização ou talvez algo que você não lembra, mas não tem tempo para pesquisar. Além disso, há uma seção onde, se você estiver na escola e praticando articulações e posições, poderá acompanhar e salvar seu progresso de forma organizada. Isenção de responsabilidade: as informações neste aplicativo são exclusivamente minhas e de forma alguma são endossadas ou afiliadas a qualquer organização autorizada. Use as informações contidas neste aplicativo a seu critério e, por todos os meios, procure a biblioteca de informações de soldagem da American Welding Society e da coleção ASME. A soldagem é um campo em constante evolução e todas as ilustrações e descrições específicas podem ser consideradas adequadas para orientação geral. É a escolha do usuário deste aplicativo usá-lo para a aplicação pretendida.
zh_hans: 该应用程序旨在快速参考其他书籍和卷中更详细的主题。这并不是试图取代已经存在的丰富知识。使用此应用程序作为复习或可能是您不记得但没有时间研究的内容。此外，还有一个部分，如果您在学校并且正在练习关节和姿势，您可以以有组织的方式跟踪并保存您的进度。 免责声明：此应用程序中的信息纯粹是我自己的，绝不认可或隶属于任何权威组织。请自行决定使用此应用程序中包含的信息，并务必从美国焊接协会和 ASME 收藏中查找焊接信息库。焊接是一个不断发展的领域，所有插图和具体描述均可被认为适合一般指导。该应用程序的用户选择将其用于他或她的预期应用程序。

source: This refers to a material which is placed on the root side of a weld to help control the penetration. An example of this would be on a groove weld to which there is not sufficient skill or requirement to have an open root scenario and this would be one of the essential variables. On a prequalified welding procedure, there will be information relating to the type of joint and process used to indicate which bevel would be permitted as well as the root opening. This information is different than what one would find on an open root joint. What does all this mean? Essentially, you would place a piece of material - such as: 1/4" X 1" X 9" flat bar - along the back or root side of the two members being welded by tack welding it to the root side. This materiial, along with the weldment, would then be welded from the face side of the joint. When this joint is to be destructively tested, the backing material must be removed before the test specimens can be tested and this brings many men to tears because of the grinding required.
es_419: Esto se refiere a un material que se coloca en el lado de la raíz de una soldadura para ayudar a controlar la penetración. Un ejemplo de esto sería en una soldadura de ranura para la cual no hay suficiente habilidad o requerimiento para tener un escenario de raíz abierta y esta sería una de las variables esenciales. En un procedimiento de soldadura precalificado, habrá información relacionada con el tipo de unión y proceso utilizado para indicar qué bisel se permitiría así como la apertura de la raíz. Esta información es diferente de la que se encontraría en una articulación de raíz abierta. ¿Qué significa todo esto? Básicamente, colocaría una pieza de material, como por ejemplo: barra plana de 1/4" X 1" X 9", a lo largo de la parte posterior o del lado de la raíz de los dos miembros que se van a soldar mediante soldadura por puntos al lado de la raíz. Este material, junto con la soldadura, luego se soldaría desde el lado frontal de la junta. Cuando esta junta se va a probar destructivamente, se debe quitar el material de respaldo antes de que se puedan probar las muestras de prueba y esto hace llorar a muchos hombres debido al esmerilado. requerido.
fil_ph: Ito ay tumutukoy sa isang materyal na inilalagay sa root side ng isang weld upang makatulong na kontrolin ang pagtagos. Ang isang halimbawa nito ay sa isang groove weld kung saan walang sapat na kasanayan o kinakailangan para magkaroon ng open root scenario at ito ay isa sa mga mahahalagang variable. Sa isang prequalified na pamamaraan ng welding, magkakaroon ng impormasyon na may kaugnayan sa uri ng joint at proseso na ginamit upang ipahiwatig kung aling bevel ang papahintulutan pati na rin ang root opening. Ang impormasyong ito ay iba kaysa sa kung ano ang makikita ng isa sa isang bukas na pinagsanib na ugat. Ano ang ibig sabihin ng lahat ng ito? Sa esensya, maglalagay ka ng isang piraso ng materyal - tulad ng: 1/4" X 1" X 9" flat bar - sa likod o gilid ng ugat ng dalawang miyembro na hinangin sa pamamagitan ng tack welding nito sa gilid ng ugat. Ang materyal na ito, kasama ang weldment, pagkatapos ay hinangin mula sa mukha na bahagi ng joint. Kapag ang joint na ito ay susubukan nang mapanirang, ang backing material ay dapat tanggalin bago masuri ang test specimens at ito ay nagpapaluha sa maraming lalaki dahil sa paggiling kailangan.
ht: Sa refere a yon materyèl ki mete sou bò rasin yon soude pou ede kontwole pénétration la. Yon egzanp sa a ta dwe sou yon soude Groove ki pa gen ase konpetans oswa egzijans pou gen yon senaryo rasin louvri epi sa a ta dwe youn nan varyab esansyèl yo. Sou yon pwosedi soude prekalifye, pral gen enfòmasyon ki gen rapò ak kalite jwenti ak pwosesis yo itilize pou endike ki bizo ki ta pèmèt ak ouvèti rasin lan. Enfòmasyon sa a diferan de sa yon moun ta jwenn sou yon jwenti rasin louvri. Kisa tout sa vle di? Esansyèlman, ou ta mete yon moso nan materyèl - tankou: 1/4 "X 1" X 9" ba plat - sou do a oswa bò rasin nan de manm yo ke yo te soude pa tack soude li nan bò rasin lan. Materyèl sa a, ansanm ak soude a, ta Lè sa a, dwe soude soti nan bò figi a nan jwenti a.Lè jwenti sa a yo dwe fè tès destriktif, yo dwe retire materyèl la fè bak anvan echantiyon tès yo ka teste epi sa a pote anpil moun nan dlo nan je paske nan fanm k'ap pile a. obligatwa.
pt_br: Refere-se a um material colocado no lado da raiz de uma solda para ajudar a controlar a penetração. Um exemplo disso seria em uma solda chanfrada para a qual não há habilidade ou exigência suficiente para ter um cenário de raiz aberta e esta seria uma das variáveis ​​essenciais. Em um procedimento de soldagem pré-qualificado, haverá informações relativas ao tipo de junta e processo utilizado para indicar qual chanfro seria permitido, bem como a abertura da raiz. Esta informação é diferente daquela encontrada em uma junta de raiz aberta. O que tudo isso significa? Essencialmente, você colocaria um pedaço de material - como: barra plana de 1/4" X 1" X 9" - ao longo da parte traseira ou do lado da raiz dos dois membros que estão sendo soldados por soldagem por pontos no lado da raiz. Este material, junto com a soldagem, seria então soldado do lado da face da junta. Quando esta junta for testada destrutivamente, o material de suporte deve ser removido antes que as amostras de teste possam ser testadas e isso leva muitos homens às lágrimas por causa da retificação obrigatório.
zh_hans: 这是指放置在焊缝根部侧以帮助控制熔深的材料。一个例子是坡口焊缝，没有足够的技能或要求来形成开根场景，这将是基本变量之一。在资格预审的焊接程序中，将提供与接头类型和工艺相关的信息，用于指示允许使用哪种坡口以及根部开口。该信息与在开放根关节上找到的信息不同。这是什么意思呢？本质上，您可以沿着两个构件的背面或根部放置一块材料 - 例如：1/4" X 1" X 9" 扁钢，通过点焊将其焊接到根部一侧。这种材料，与焊件一起，然后从接头的正面进行焊接。当要对该接头进行破坏性测试时，必须在测试样本之前除去背衬材料，这使许多人因打磨而流泪。必需的。

source: To begin with oxyfuel welding, there's a structured approach to adopt. Your journey should start with the acquisition of the manufacturer's instructions tailored to your specific equipment brand. These guidelines are crucial, serving as your initial compass in the expansive realm of oxyfuel welding. Also, consider what the Oxyfuel torch is designed to do: You can weld, braze and general purpose heat with it but not cut the metal. Cutting metal is only meant for the cutting torch. Upon determining the thickness of the steel you're dealing with, the manufacturer's guidelines will direct you to an appropriate tip selection and specify the requisite flow rates. Once these essentials are pinpointed, you'll embark on an equipment check – ensuring connections are tight, and everything is in prime working order.
es_419: Para empezar con la soldadura con oxicorte, hay que adoptar un enfoque estructurado. Su viaje debe comenzar con la adquisición de las instrucciones del fabricante adaptadas a su marca de equipo específica. Estas pautas son cruciales y sirven como su brújula inicial en el amplio ámbito de la soldadura con oxicorte. Además, considere para qué está diseñado el soplete Oxyfuel: puede soldar y calentar con fines generales, pero no cortar el metal. El corte de metal sólo está diseñado para el soplete de corte. Al determinar el espesor del acero con el que está tratando, las pautas del fabricante lo dirigirán a una selección de punta adecuada y especificarán los caudales necesarios. Una vez identificados estos elementos esenciales, se embarcará en una revisión del equipo, asegurándose de que las conexiones estén apretadas y que todo esté en óptimas condiciones de funcionamiento.
fil_ph: Upang magsimula sa oxyfuel welding, mayroong isang structured na diskarte na dapat gamitin. Dapat magsimula ang iyong paglalakbay sa pagkuha ng mga tagubilin ng tagagawa na iniayon sa iyong partikular na tatak ng kagamitan. Ang mga alituntuning ito ay mahalaga, na nagsisilbing iyong paunang compass sa malawak na larangan ng oxyfuel welding. Isa pa, isaalang-alang kung ano ang idinisenyong gawin ng Oxyfuel torch: Maaari kang magwelding, mag-braze at magpainit gamit ang pangkalahatang layunin ngunit hindi gupitin ang metal. Ang pagputol ng metal ay para lamang sa cutting torch. Sa pagtukoy sa kapal ng bakal na iyong kinakaharap, ang mga alituntunin ng tagagawa ay magdidirekta sa iyo sa isang naaangkop na pagpili ng tip at tukuyin ang kinakailangang mga rate ng daloy. Kapag natukoy na ang mga mahahalagang bagay na ito, sisimulan mo ang isang pagsusuri sa kagamitan – tinitiyak na mahigpit ang mga koneksyon, at lahat ay nasa mahusay na pagkakasunud-sunod.
ht: Pou kòmanse ak soude oxyfuel, gen yon apwòch estriktire yo adopte. Vwayaj ou a ta dwe kòmanse ak akizisyon de enstriksyon manifakti a ki adapte ak mak ekipman espesifik ou. Gid sa yo enpòtan anpil, k ap sèvi kòm konpa inisyal ou nan domèn awogan soude oksicarburant. Epitou, konsidere kisa flanbo Oxyfuel la fèt pou fè: Ou ka soude, brase ak chalè jeneral avèk li men ou pa koupe metal la. Koupe metal se sèlman vle di pou flanbo a koupe. Lè w fin detèmine epesè asye w ap fè fas ak, direktiv manifakti a pral dirije w nan yon seleksyon pwent apwopriye epi presize pousantaj koule yo mande yo. Yon fwa ke esansyèl sa yo detèmine, ou pral s'angajè sou yon chèk ekipman - asire koneksyon yo sere, ak tout bagay an premye fonksyone.
pt_br: Para começar com a soldagem oxicorte, há uma abordagem estruturada a ser adotada. Sua jornada deve começar com a aquisição das instruções do fabricante adaptadas à marca específica do seu equipamento. Essas diretrizes são cruciais, servindo como sua bússola inicial no amplo domínio da soldagem oxicorte. Além disso, considere o que a tocha Oxyfuel foi projetada para fazer: você pode soldar, brasar e aquecer de uso geral com ela, mas não pode cortar o metal. O corte de metal destina-se apenas à tocha de corte. Ao determinar a espessura do aço com o qual você está lidando, as orientações do fabricante irão direcioná-lo para uma seleção de ponta apropriada e especificar as taxas de fluxo necessárias. Depois que esses itens essenciais forem identificados, você iniciará uma verificação do equipamento – garantindo que as conexões estejam firmes e que tudo esteja em perfeitas condições de funcionamento.
zh_hans: 要开始进行氧燃料焊接，需要采用一种结构化方法。您的旅程应该从获取针对您的特定设备品牌量身定制的制造商说明开始。这些指南至关重要，可以作为您在氧燃料焊接广阔领域中的初始指南针。 另外，请考虑氧燃料割炬的设计用途：您可以用它进行焊接、钎焊和通用加热，但不能切割金属。切割金属仅适用于割炬。 确定您要处理的钢材的厚度后，制造商的指南将指导您选择合适的喷嘴并指定所需的流速。一旦确定了这些要点，您就将开始设备检查——确保连接紧密，一切都处于最佳工作状态。

source: To comprehend SMAW's essence, it's imperative to grasp its underlying principles. SMAW operates on a Constant Current (CC) principle, sometimes referred to as Constant Amperage. In layman's terms, this implies that the output current, once set, remains relatively stable, while the voltage might vary to align with the chosen current. This trait of being a CC-type welding system means that, when necessary, SMAW equipment can be transitioned to serve Gas Tungsten Arc Welding (GTAW) purposes, demonstrating its adaptability.
es_419: Para comprender la esencia de SMAW, es imperativo comprender sus principios subyacentes. SMAW funciona según un principio de corriente constante (CC), a veces denominado amperaje constante. En términos sencillos, esto implica que la corriente de salida, una vez configurada, permanece relativamente estable, mientras que el voltaje puede variar para alinearse con la corriente elegida. Esta característica de ser un sistema de soldadura de tipo CC significa que, cuando sea necesario, el equipo SMAW se puede realizar la transición para servir con fines de soldadura por arco de tungsteno con gas (GTAW), lo que demuestra su adaptabilidad.
fil_ph: Upang maunawaan ang kakanyahan ng SMAW, kailangang maunawaan ang mga pinagbabatayan nitong prinsipyo. Ang SMAW ay gumagana sa isang Constant Current (CC) na prinsipyo, kung minsan ay tinutukoy bilang Constant Amperage. Sa mga termino ng karaniwang tao, ito ay nagpapahiwatig na ang output kasalukuyang, sa sandaling nakatakda, ay nananatiling medyo matatag, habang ang boltahe ay maaaring mag-iba upang ihanay sa napiling kasalukuyang. Ang katangiang ito ng pagiging isang CC-type na welding system ay nangangahulugan na, kung kinakailangan, ang kagamitan ng SMAW ay maaaring ilipat upang magsilbi sa mga layunin ng Gas Tungsten Arc Welding (GTAW), na nagpapakita ng kakayahang umangkop nito.
ht: Pou konprann sans SMAW a, li enperatif pou konprann prensip ki kache yo. SMAW opere sou yon prensip Konstan Kouran (CC), pafwa refere yo kòm Anperaj Konstan. An tèm pwofàn, sa a implique ke aktyèl pwodiksyon an, yon fwa mete, rete relativman estab, pandan y ap vòltaj la ka varye aliman ak aktyèl la chwazi. Karakteristik sa a pou yo te yon sistèm soude CC-type vle di ke, lè sa nesesè, ekipman SMAW ka fè tranzisyon pou sèvi objektif gaz Tungstène Arc Welding (GTAW), demontre adaptabilite li.
pt_br: Para compreender a essência do SMAW, é imperativo compreender os seus princípios subjacentes. O SMAW opera com base no princípio de Corrente Constante (CC), às vezes chamado de Amperagem Constante. Em termos leigos, isto implica que a corrente de saída, uma vez definida, permanece relativamente estável, enquanto a tensão pode variar para se alinhar com a corrente escolhida. Esta característica de ser um sistema de soldagem do tipo CC significa que, quando necessário, o equipamento SMAW pode ser transicionado para atender propósitos de soldagem a arco de gás tungstênio (GTAW), demonstrando sua adaptabilidade.
zh_hans: 要理解焊条电弧焊的本质，必须掌握其基本原理。 SMAW 的工作原理是恒流 (CC)，有时也称为恒电流。通俗地说，这意味着输出电流一旦设置，就会保持相对稳定，而电压可能会发生变化以与所选电流保持一致。 CC 型焊接系统的这一特点意味着，在必要时，SMAW 设备可以转换为钨极气体保护焊 (GTAW) 用途，从而展示其适应性。
